# Brewfile

tap 'homebrew/cask'
tap 'homebrew/bundle'

brew "neovim"
brew "ripgrep"
brew "tmux"
brew "vim"

if OS.mac?
  brew "ctags"
  brew "gh", args: ["HEAD"]
  brew "git"
  brew "jq"
  brew "neovim"
  brew "node@14"
  brew "ripgrep"
  brew "yarn"

  cask "1password"
  cask "appcleaner"
  cask "arq"
  cask "brave-browser"
  cask "google-chrome"
  cask "graphiql"
  cask "iterm2"
  cask "jumpcut"
  cask "macdown"
  cask "postman"
  cask "rectangle"
  cask "spotify"
end
